Revit 2027 API
Transform2D.BasisU Property
 The image of (1, 0) under OfVector(UV).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV BasisU { get; set; }
Public Property BasisU As UV
	Get
	Set
public:
property UV^ BasisU {
	UV^ get ();
	void set (UV^ value);
}
member BasisU : UV with get, set
Property Value
UV
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
Transform2D Class
Autodesk.Revit.DB Namespace